notes/meeting_2022jun19.org
* meeting notes June 19, 2022
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jun19.md
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/2022jun19

*** topics
**** regex feature: control what's captured with <( ... )>
***** from an old question in my notes:
****** Q: what's the Raku equivalent for p5's \K?

**** unix.stackexchange

**** rob ramsbottom
***** relating to the community

*** from the last meeting notes
**** continuing adventures with move/copy/rename
***** roast test checks whether the old file name is gone after rename
****** roast/S32-io/rename.t
***** I found I needed to unlink the old after a rename
****** https://github.com/doomvox/raku-study/bin/2022mar13/tagger.raku
***** how can you resolve that contradiction? 
****** try this: roast test uses temp files in current directory
******* /home/doom/End/Cave/Raku/Wall/darkroast/S32-io/rename.t
******* eventually this will bt out: https://github.com/doomvox/darkroast
***** some basics
****** https://github.com/doomvox/raku-study/bin/2022jun05/trial-mkdir.raku



*** for future meetings 

**** some relatively recent weekly challenges that weren't number theory trivia for once
***** Task 1: Hexadecimal Words; Task 2: K-Directory Diff
****** https://theweeklychallenge.org/blog/perl-weekly-challenge-166/
****** arne sommers
******* https://raku-musings.com/hexa-diff.html
***** Task 1: Scalable Vector Graphics (SVG); Task 2: Line of Best Fit
****** https://theweeklychallenge.org/blog/perl-weekly-challenge-165/
****** arne sommers
******* https://raku-musings.com/doubly-scalable.html

**** jonathan worthington on cro memory usage
***** https://stackoverflow.com/questions/72180995/understanding-cro-request-response-cycle-and-memory-use
**** jonathan worthington on operator precedence, = vs ,
***** https://stackoverflow.com/questions/72081593/assignment-destructuring-and-operator-precedence



** announcements 
*** July 10th: next raku study group meeting (in 3 weeks: skipping the weekend of the 4th)
*** June 21-25: tprc: perl/raku conference 
**** 4 hours of Bruce Gray: talk + 3hr tutorial
***** https://tprc2022.sched.com/event/ylEK/command-line-filters-time-to-shine
***** https://tprc2022.sched.com/overview/type/Raku+Track
